ERM/src/InformationRegisters/ПолучателиУведомленийUnbilled.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПолучателиУведомленийUnbilled</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ResponsibleAR</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EscalationLevels</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/ОчередьОбновленияSalesOrderResponsibles/ОчередьОбновленияSalesOrderResponsibles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОбновленияSalesOrderResponsibles</name>
  <resources>
    <name>ДатаВМиллиСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Source</name>
    <type>
      <types>EnumRef.ТипыСоответствий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор1</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор2</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/InformationRegisters/ПолучателиУведомленийUnbilled/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
		ЭтоResponsibleAR = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаписьНабора.Получатель, "ResponsibleAR");
		Если ЭтоResponsibleAR И ЗаписьНабора.Уровень <> Справочники.EscalationLevels.Level1 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Responsible AR is only available for Level 1", , , , Отказ);
		КонецЕсли;
		Если Не Отказ И ЭтоResponsibleAR Тогда
			РегистрыСведений.ОчередьОбновленияSalesOrderResponsibles.Добавить(ЗаписьНабора.Source, ЗаписьНабора.Идентификатор1, ЗаписьНабора.Идентификатор2);
		КонецЕсли;
	КонецЦикла;
	
	Если Не Отказ И Замещение Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПолучателиУведомленийUnbilled.Source,
			|	ПолучателиУведомленийUnbilled.Идентификатор1,
			|	ПолучателиУведомленийUnbilled.Идентификатор2
			|ИЗ
			|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
			|ГДЕ
			|	ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR
			|	И ПолучателиУведомленийUnbilled.Source = &Source
			|	И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1
			|	И ПолучателиУведомленийUnbilled.Идентификатор2 = &Идентификатор2
			//|	И ПолучателиУведомленийUnbilled.Уровень = ЗНАЧЕНИЕ(Справочник.EscalationLevels.Level1)
			|	И ПолучателиУведомленийUnbilled.Уровень = &Уровень
			|	И ПолучателиУведомленийUnbilled.Получатель = &Получатель";
			
		Если ЭтотОбъект.Отбор.Source.Использование Тогда
			Запрос.УстановитьПараметр("Source", ЭтотОбъект.Отбор.Source.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Source = &Source", "");
		КонецЕсли;
		Если ЭтотОбъект.Отбор.Идентификатор1.Использование Тогда
			Запрос.УстановитьПараметр("Идентификатор1", ЭтотОбъект.Отбор.Идентификатор1.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1", "");
		КонецЕсли;
		Если ЭтотОбъект.Отбор.Идентификатор2.Использование Тогда
			Запрос.УстановитьПараметр("Идентификатор2", ЭтотОбъект.Отбор.Идентификатор2.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Идентификатор2 = &Идентификатор2", "");
		КонецЕсли;
		Если ЭтотОбъект.Отбор.Получатель.Использование Тогда
			Запрос.УстановитьПараметр("Получатель", ЭтотОбъект.Отбор.Получатель.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Получатель = &Получатель", "");
		КонецЕсли;
		Если ЭтотОбъект.Отбор.Уровень.Использование Тогда
			Запрос.УстановитьПараметр("Уровень", ЭтотОбъект.Отбор.Уровень.Значение);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПолучателиУведомленийUnbilled.Уровень = &Уровень", "");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			РегистрыСведений.ОчередьОбновленияSalesOrderResponsibles.Добавить(ВыборкаДетальныеЗаписи.Source, ВыборкаДетальныеЗаписи.Идентификатор1, ВыборкаДетальныеЗаписи.Идентификатор2);
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	//Для каждого ЗаписьНабора Из ЭтотОбъект Цикл
	//	
	//	Если ЗаписьНабора.Уровень <> Справочники.EscalationLevels.Level1 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПолучателиУведомленийUnbilled.Получатель) КАК КоличествоОтветственных
	//		|ИЗ
	//		|	РегистрСведений.ПолучателиУведомленийUnbilled КАК ПолучателиУведомленийUnbilled
	//		|ГДЕ
	//		|	ПолучателиУведомленийUnbilled.Source = &Source
	//		|	И ПолучателиУведомленийUnbilled.Идентификатор1 = &Идентификатор1
	//		|	И ПолучателиУведомленийUnbilled.Идентификатор2 = &Идентификатор2
	//		|	И ПолучателиУведомленийUnbilled.Уровень = &Уровень
	//		|	И ПолучателиУведомленийUnbilled.Получатель.ResponsibleAR";
	//	
	//	Запрос.УстановитьПараметр("Source", ЗаписьНабора.Source);
	//	Запрос.УстановитьПараметр("Идентификатор1", ЗаписьНабора.Идентификатор1);
	//	Запрос.УстановитьПараметр("Идентификатор2", ЗаписьНабора.Идентификатор2);
	//	Запрос.УстановитьПараметр("Уровень", ЗаписьНабора.Уровень);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	//	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//		
	//		Если ВыборкаДетальныеЗаписи.КоличествоОтветственных > 1 Тогда
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("You can not specify more than one responsible!", , , , Отказ);
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры
